-- =============================================================================
-- db_quotas_2018
-- tb_basin - таблица 'Бассейн промысла ВБР(рыбопромысловый бассейн)'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_basin
(
	id_basin INT NOT NULL PRIMARY KEY,			-- идентификатор бассейна промысла ВБР
	basin VARCHAR(32) NOT NULL DEFAULT '',		-- наименование бассейна промысла ВБР
	basin_abbr VARCHAR(4) NOT NULL DEFAULT ''	-- аббревиатура бассейна промысла ВБР
);												
