-- =============================================================================
-- db_quotas_2018
-- tb_document_type - таблица 'Тип нормативного документа'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_document_type
(
	id_document_type INT NOT NULL PRIMARY KEY,		-- идентификатор типа нормативного документа
	document_type VARCHAR(32) NOT NULL DEFAULT '' 	-- наименование типа нормативного документа
);
