-- =============================================================================
-- db_quotas_2018
-- tb_organization_approval - таблица 'Утверждающая организация'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_organization_approval
(
	id_organization_approval INT NOT NULL PRIMARY KEY,		-- идентификатор утверждающей организации
	organization_approval VARCHAR(128) NOT NULL DEFAULT ''	-- наименование утверждающей организации
);
