--=============================================================================
-- db_quotas_2018
-- tb_quota_type - таблица 'вид квоты на добычу ВБР'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  27-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
--=============================================================================
CREATE TABLE IF NOT EXISTS tb_quota_type
(
	id_quota_type INT NOT NULL PRIMARY KEY,				-- идентификатор вида квоты на добычу ВБР
    can_share INT NOT NULL DEFAULT 1, 					-- признак разделения между субъектами РФ
    quota_type VARCHAR(64) NOT NULL DEFAULT '', 		-- наименование вида квоты на добычу ВБР
    quota_type_by_order VARCHAR(64) NOT NULL DEFAULT '' -- наименование вида квоты на добычу ВБР, согласно утверждённого приказа
);
