-- =============================================================================
-- db_quotas_2018
-- tb_region - таблица 'район добычи(промысла) ВБР'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  27-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_region
(
	id_region INT NOT NULL PRIMARY KEY,						--идентификатор района добычи(промысла) ВБР
 	id_region_fms INT NOT NULL DEFAULT 0,					--идентификатор района добычи(промысла) ВБР в ОСМ(FMS - Fishery Monitoring System)
 	sort_order INT NOT NULL DEFAULT 2147483647,				--порядок сортировки в справочнике (0x7FFFFFFF)
    region VARCHAR(64) NOT NULL,							--наименование района добычи(промысла) ВБР
    region_title_by_order VARCHAR(64) NOT NULL DEFAULT ''	--наименование района добычи(промысла) ВБР, согласно утверждённого приказа
);
