-- =============================================================================
-- db_quotas_2018
-- tb_region_hierachy - таблица 'Иерархия района добычи(промысла) ВБР'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_region_hierachy
(
	id_region INT NOT NULL,		-- идентификатор района добычи(промысла) ВБР
	id_region_top INT NOT NULL 	-- идентификатор района добычи(промысла) ВБР верхнего(обобщающего) уровня
, 
    CONSTRAINT PK_tb_region_hierachy PRIMARY KEY (id_region, id_region_top)
);
