-- =============================================================================
-- db_quotas_2018
-- tb_unit - таблица 'Единица измерения'
-- PostgreSQL
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2017
-- Дата обновления:         03-04-2017
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
-- =============================================================================
CREATE TABLE IF NOT EXISTS tb_unit
(
	id_unit INT NOT NULL PRIMARY KEY,			-- идентификатор единицы измерения
    unit VARCHAR(16) NOT NULL DEFAULT ''		-- наименование единицы измерения
);
