/*
--=============================================================================
-- db_quotas_2018
-- [dbo].[tb_organization_approval] - таблица 'Утверждающая организация'
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2018
-- Дата обновления:         28-03-2018
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
--=============================================================================
*/
CREATE TABLE [dbo].[tb_organization_approval]
(
	[id_organization_approval] INT NOT NULL PRIMARY KEY,		--идентификатор утверждающей организации
	[organization_approval] NVARCHAR(128) NOT NULL DEFAULT ''	--наименование утверждающей организации
)
