/*
--=============================================================================
-- db_quotas_2018
-- [dbo].[tb_subject] - таблица 'субъект РФ'
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2018
-- Дата обновления:         28-03-2018
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
--=============================================================================
*/
CREATE TABLE [dbo].[tb_subject]
(
	[id_subject] INT NOT NULL PRIMARY KEY,						--идентификатор субъекта РФ
 	[id_subject_fms] INT NOT NULL DEFAULT 0,					--идентификатор субъекта РФ в ОСМ(FMS - Fishery Monitoring System)
 	[sort_order] INT NOT NULL DEFAULT 0x7FFFFFFF,				--порядок сортировки в справочнике
    [subject] NVARCHAR(64) NOT NULL,							--наименование субъекта РФ
    [subject_title_by_order] NVARCHAR(64) NOT NULL DEFAULT ''	--наименование субъекта РФ, согласно утверждённого приказа
);
