/*
--=============================================================================
-- db_quotas_2018
-- [dbo].[tb_basin] - таблица 'Бассейн промысла ВБР(рыбопромысловый бассейн)'
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2018
-- Дата обновления:         28-03-2018
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
--=============================================================================
*/
CREATE TABLE [dbo].[tb_basin]
(
	[id_basin] INT NOT NULL PRIMARY KEY,			--идентификатор бассейна промысла ВБР
	[basin] NVARCHAR(32) NOT NULL DEFAULT '',		--наименование бассейна промысла ВБР
	[basin_abbr] NVARCHAR(4) NOT NULL DEFAULT ''	--аббревиатура бассейна промысла ВБР
);												
													