/*
--=============================================================================
-- db_quotas_2018
-- [dbo].[tb_subject_hierarchy] - таблица 'Иерархия субъекта РФ'
-- Автор: Иванченко М.В.
-- Дата начала разработки:  28-03-2018
-- Дата обновления:         28-03-2018
-- Первый релиз:            0.0.0.0
-- Текущий релиз:           0.0.0.0
--=============================================================================
*/
CREATE TABLE [dbo].[tb_subject_hierarchy]
(
	[id_subject] INT NOT NULL,		--идентификатор субъекта РФ
	[id_subject_top] INT NOT NULL 	--идентификатор субъекта РФ верхнего(обобщающего) уровня
, 
    CONSTRAINT [PK_tb_subject_hierarchy] PRIMARY KEY ([id_subject], [id_subject_top])
);
